webshop-integration/webshop-integration-keypair/src/test/resources/soap-messages/getTransactionRequest-1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#WithComments"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI=""><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>78Jh+h7250SEZaFDwPH9IaR0yx4=</DigestValue></Reference></SignedInfo><SignatureValue>v/G+PFikMm0iLjZ9jcZoDQYolGyhLPuD7Rd9hRglH1K7sCds3tW3Qc93oW7l9AyP9ReXfO3gIz1V
O6xu1gr0VcJDrtSRiG8KFE80lnbliJ7rxUHx68kvbpOsKEFOuiCzTuquRfEa4PknMZQpHDp2qFAx
UvtCeAWWrN5hh0YzGLs=</SignatureValue></Signature></SOAP-ENV:Header>
<SOAP-ENV:Body xmlns:SOAP-SEC="http://schemas.xmlsoap.org/soap/security/2000-12" SOAP-SEC:id="Body">
<tran:getTransaction xmlns:tran="http://www.allpay.kz/mfs/soap/TransactionManagement">
<GetTransactionRequest>
<transactionNumber>1</transactionNumber>
</GetTransactionRequest>
</tran:getTransaction>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
